varigit/freertos-variscite/boards/som_mx8qx/cmsis_driver_examples/lpuart/edma_transfer/pin_mux.h
/*
 * Copyright 2017-2018 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */


#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

#include "board.h"

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/* UART1_RX (coord L31), UART1_RX */
#define LPUART_INITPINS_DEBUG_UART_RX_PERIPHERAL                  ADMA__UART1   /*!< Device name: ADMA__UART1 */
#define LPUART_INITPINS_DEBUG_UART_RX_SIGNAL                          uart_rx   /*!< ADMA__UART1 signal: uart_rx */
#define LPUART_INITPINS_DEBUG_UART_RX_PIN_NAME                       UART1_RX   /*!< Pin name */
#define LPUART_INITPINS_DEBUG_UART_RX_PIN_FUNCTION_ID           SC_P_UART1_RX   /*!< Pin function id */
#define LPUART_INITPINS_DEBUG_UART_RX_LABEL                  "DEBUG_UART1_RX"   /*!< Label */
#define LPUART_INITPINS_DEBUG_UART_RX_NAME                   "DEBUG_UART1_RX"   /*!< Identifier name */

/* UART1_TX (coord H34), UART1_TX */
#define LPUART_INITPINS_DEBUG_UART_TX_PERIPHERAL                  ADMA__UART1   /*!< Device name: ADMA__UART1 */
#define LPUART_INITPINS_DEBUG_UART_TX_SIGNAL                          uart_tx   /*!< ADMA__UART1 signal: uart_tx */
#define LPUART_INITPINS_DEBUG_UART_TX_PIN_NAME                       UART1_TX   /*!< Pin name */
#define LPUART_INITPINS_DEBUG_UART_TX_PIN_FUNCTION_ID           SC_P_UART1_TX   /*!< Pin function id */
#define LPUART_INITPINS_DEBUG_UART_TX_LABEL                  "DEBUG_UART1_TX"   /*!< Label */
#define LPUART_INITPINS_DEBUG_UART_TX_NAME                   "DEBUG_UART1_TX"   /*!< Identifier name */

/* UART1_TX (coord H34), UART1_TX */
#define LPUART_DEINITPINS_DEBUG_UART_TX_GPIO                      LSIO__GPIO0   /*!< GPIO device name: LSIO__GPIO0 */
#define LPUART_DEINITPINS_DEBUG_UART_TX_GPIO_PIN                          21U   /*!< LSIO__GPIO0 pin index: 21 */
#define LPUART_DEINITPINS_DEBUG_UART_TX_PIN_NAME                     UART1_TX   /*!< Pin name */
#define LPUART_DEINITPINS_DEBUG_UART_TX_PIN_FUNCTION_ID         SC_P_UART1_TX   /*!< Pin function id */
#define LPUART_DEINITPINS_DEBUG_UART_TX_LABEL                "DEBUG_UART1_TX"   /*!< Label */
#define LPUART_DEINITPINS_DEBUG_UART_TX_NAME                 "DEBUG_UART1_TX"   /*!< Identifier name */

/* UART1_RX (coord L31), UART1_RX */
#define LPUART_DEINITPINS_DEBUG_UART_RX_GPIO                      LSIO__GPIO0   /*!< GPIO device name: LSIO__GPIO0 */
#define LPUART_DEINITPINS_DEBUG_UART_RX_GPIO_PIN                          22U   /*!< LSIO__GPIO0 pin index: 22 */
#define LPUART_DEINITPINS_DEBUG_UART_RX_PIN_NAME                     UART1_RX   /*!< Pin name */
#define LPUART_DEINITPINS_DEBUG_UART_RX_PIN_FUNCTION_ID         SC_P_UART1_RX   /*!< Pin function id */
#define LPUART_DEINITPINS_DEBUG_UART_RX_LABEL                "DEBUG_UART1_RX"   /*!< Label */
#define LPUART_DEINITPINS_DEBUG_UART_RX_NAME                 "DEBUG_UART1_RX"   /*!< Identifier name */

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif


/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 * @param ipc scfw ipchandle.
 *
 */
void BOARD_InitPins(sc_ipc_t ipc);                         /*!< Function assigned for the core: Cortex-M4F[m4] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 * @param ipc scfw ipchandle.
 *
 */
void LPUART_InitPins(sc_ipc_t ipc);                        /*!< Function assigned for the core: Cortex-M4F[m4] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 * @param ipc scfw ipchandle.
 *
 */
void LPUART_DeinitPins(sc_ipc_t ipc);                      /*!< Function assigned for the core: Cortex-M4F[m4] */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
